---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DirectContext3DFailures.NoMoreExternalDataTypeInstances
source: html/b988c9fa-402d-ad52-4f75-5b9f0b1fe002.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DirectContext3DFailures.NoMoreExternalDataTypeInstances Property

No more instances of the Coordination Model.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoMoreExternalDataTypeInstances { get; }
```